[Killed] BlockStatement
src/main/pages/LoginPage.js:6:25
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import "main/pages/css/LoginPage.css";
 
-const LoginCard = () => {
-  return (
-    <Card className="login-card">
-      <Card.Body>
-        <Card.Title data-testid="loginPage-cardTitle">Welcome to Organic!</Card.Title>
-        <Card.Text>
-          To access features, please login with your Github account.
-        </Card.Text>
-        <Button href="/oauth2/authorization/github" variant="primary" className="login-btn">Log In</Button>
-      </Card.Body>
-    </Card>
-  );
-};
+const LoginCard = () => {};
 
 export default function LoginPage() {
killedBy: LoginPage tests renders without crashing when lists return empty list
statusReason: Error: LoginCard(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/main/pages/LoginPage.js:20:37
   );
 };
 
-export default function LoginPage() {
-  return (
-    <div className="login-page-background"> 
-      <BasicLayout>
-        <Container className="login-container"> 
-          <Row className="align-items-center justify-content-center"> 
-            <Col sm="auto"><LoginCard /></Col>
-          </Row>
-        </Container>
-      </BasicLayout>
-    </div>
-  );
-}
+export default function LoginPage() {}
 
killedBy: LoginPage tests renders without crashing when lists return empty list
statusReason: Error: LoginPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
