[Killed] BlockStatement
src/main/pages/LoginPage.js:23:37
   )
 }
 
-export default function LoginPage() {
-
-  const time = new Date().getHours();
-  
-  return (
-    <div> 
-      <BasicLayout>
-        <Container style={
-          // Stryker disable next-line all : no need to unit test CSS
-          { marginTop: "8%" }}>
-          <Row style={
-            // Stryker disable next-line all : no need to unit test CSS
-            { alignItems: "center", justifyContent: "center" }}>
-            <Col sm="auto"><LoginCard /></Col>
-          </Row>
-        </Container>
-      </BasicLayout>
-    </div>
-  )
-}
+export default function LoginPage() {}
 
killedBy: LoginPage tests renders without crashing when lists return empty list
statusReason: Error: LoginPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
