[Killed] ObjectLiteral
main/components/Users/UsersTable.js:22:5
         Header: 'Email',
         accessor: 'email',
     },
-    {
-        Header: 'Last Online',
-        id: 'lastOnline',
-        accessor: (row) => formatTime(row.lastOnline),
-    },
+    {},
     {
         Header: 'Admin',
killedBy: UserTable tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!
