[Killed] BlockStatement
src/main/pages/ProfilePage.js:6:27
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import ReactJson from "react-json-view";
 
-const ProfilePage = () => {
-
-    const { data: currentUser } = useCurrentUser();
-
-    if (!currentUser.loggedIn) {
-        return (
-            <p>Not logged in.</p>
-        )
-    }
-
-    return (
-       <BasicLayout>
-            <ReactJson src={currentUser} / >
-       </BasicLayout>
-    );
-};
+const ProfilePage = () => {};
 
 export default ProfilePage;
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: ProfilePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
