[Killed] BooleanLiteral
main/components/Users/UsersTable.js:6:65
 import { formatTime } from "main/utils/dateUtils";
 import { useBackendMutation } from "main/utils/useBackend";
 
-export default function UsersTable({ users, showToggleButtons = false }) {
+export default function UsersTable({ users, showToggleButtons = true }) {
     // toggleAdmin
     function cellToAxiosParamsToggleAdmin(cell) {
killedBy: UserTable tests Does not see toggle admin and instructor buttons as regular user
statusReason: TestingLibraryElementError: Found multiple elements with the text: toggle-admin

Here are the matching elements:

<th
  colspan="1"
  data-testid="UsersTable-header-toggle-admin"
  role="columnheader"

[Killed] BlockStatement
main/components/Users/UsersTable.js:8:49
 
 export default function UsersTable({ users, showToggleButtons = false }) {
     // toggleAdmin
-    function cellToAxiosParamsToggleAdmin(cell) {
-        return {
-            url: "/api/admin/users/toggleAdmin",
-            method: "POST",
-            params: {
-                githubId: cell.row.values.githubId
-            }
-        }
-    }
+    function cellToAxiosParamsToggleAdmin(cell) {}
 
     // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:9:16
 export default function UsersTable({ users, showToggleButtons = false }) {
     // toggleAdmin
     function cellToAxiosParamsToggleAdmin(cell) {
-        return {
-            url: "/api/admin/users/toggleAdmin",
-            method: "POST",
-            params: {
-                githubId: cell.row.values.githubId
-            }
-        }
+        return {}
     }
 
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Users/UsersTable.js:11:21
     function cellToAxiosParamsToggleAdmin(cell) {
         return {
             url: "/api/admin/users/toggleAdmin",
-            method: "POST",
+            method: "",
             params: {
                 githubId: cell.row.values.githubId
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:12:21
         return {
             url: "/api/admin/users/toggleAdmin",
             method: "POST",
-            params: {
-                githubId: cell.row.values.githubId
-            }
+            params: {}
         }
     }
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "githubId": 11111,
- }

[Killed] BlockStatement
main/components/Users/UsersTable.js:30:54
     const toggleAdminCallback = async(cell) => { toggleAdminMutation.mutate(cell); }
 
     // toggleInstructor
-    function cellToAxiosParamsToggleInstructor(cell) {
-        return {
-            url: "/api/admin/users/toggleInstructor",
-            method: "POST",
-            params: {
-                githubId: cell.row.values.githubId
-            }
-        }
-    }
+    function cellToAxiosParamsToggleInstructor(cell) {}
 
     // Stryker disable all : hard to test for query caching
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:31:16
 
     // toggleInstructor
     function cellToAxiosParamsToggleInstructor(cell) {
-        return {
-            url: "/api/admin/users/toggleInstructor",
-            method: "POST",
-            params: {
-                githubId: cell.row.values.githubId
-            }
-        }
+        return {}
     }
 
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/components/Users/UsersTable.js:32:18
     // toggleInstructor
     function cellToAxiosParamsToggleInstructor(cell) {
         return {
-            url: "/api/admin/users/toggleInstructor",
+            url: "",
             method: "POST",
             params: {
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/admin/users/toggleInstructor"
Received: ""

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:52:9
     const toggleInstructorCallback = async(cell) => { toggleInstructorMutation.mutate(cell); }
 
     const columns = [
-        {
-            Header: 'githubId',
-            accessor: 'githubId', // accessor is the "key" in the data
-        },
+        {},
         {
             Header: 'githubLogin',
killedBy: AdminUsersPage tests renders without crashing on two users
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:56:9
             Header: 'githubId',
             accessor: 'githubId', // accessor is the "key" in the data
         },
-        {
-            Header: 'githubLogin',
-            accessor: 'githubLogin', // accessor is the "key" in the data
-        },
+        {},
         {
             Header: 'fullName',
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Users/UsersTable.js:57:21
             accessor: 'githubId', // accessor is the "key" in the data
         },
         {
-            Header: 'githubLogin',
+            Header: "",
             accessor: 'githubLogin', // accessor is the "key" in the data
         },
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: githubLogin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block

[Killed] StringLiteral
main/components/Users/UsersTable.js:69:21
             accessor: 'email',
         },
         {
-            Header: 'Last Online',
+            Header: "",
             id: 'lastOnline',
             accessor: (row) => formatTime(row.lastOnline),
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Last Online. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block
