[Killed] StringLiteral
main/components/Courses/CoursesForm.js:76:42
                             id="school"
                             type="text"
                             isInvalid={Boolean(errors.school)}
-                            {...register("school", { required: true })}
+                            {...register("", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests calls enableEndDateValidation on mount
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Courses/CoursesForm.js:142:42
                             id="githubOrg"
                             type="text"
                             isInvalid={Boolean(errors.githubOrg)}
-                            {...register("githubOrg", { required: true })}
+                            {...register("", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: CoursesForm tests calls enableEndDateValidation on mount
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
