[Killed] BlockStatement
src/main/components/OurTable.js:102:42
 //   ButtonColumn("Delete", "danger", deleteCallback)
 // ];
 
-export function isValidHexColor(variant) {
-  return /^#([0-9A-F]{3}){1,2}$/i.test(variant);
-}
+export function isValidHexColor(variant) {}
 
 export function ButtonColumn(label, variant, callback, testid) {
killedBy: OurTable tests Button with hex color code appears with correct style and is clickable
statusReason: Error: expect(element).toHaveStyle()

- Expected

- background-color: rgb(76, 175, 80);
+ background-color: ButtonFace;

[Killed] Regex
src/main/components/OurTable.js:103:10
 // ];
 
 export function isValidHexColor(variant) {
-  return /^#([0-9A-F]{3}){1,2}$/i.test(variant);
+  return /#([0-9A-F]{3}){1,2}$/i.test(variant);
 }
 
killedBy: isValidHexColor rejects hex color codes with extra characters at the start
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] Regex
src/main/components/OurTable.js:103:10
 // ];
 
 export function isValidHexColor(variant) {
-  return /^#([0-9A-F]{3}){1,2}$/i.test(variant);
+  return /^#([0-9A-F]{3}){1,2}/i.test(variant);
 }
 
killedBy: isValidHexColor rejects hex color codes with extra characters at the end
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/main/components/OurTable.js:106:64
   return /^#([0-9A-F]{3}){1,2}$/i.test(variant);
 }
 
-export function ButtonColumn(label, variant, callback, testid) {
-  const column = {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => {
-      const isHexColor = isValidHexColor(variant);
-      
-      const buttonProps = isHexColor 
-        ? { style: { backgroundColor: variant, color: getContrastYIQ(variant) } } 
-        : { variant };
-
-      return (
-        <Button
-          {...buttonProps}
-          onClick={() => callback(cell)}
-          data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-        >
-          {label}
-        </Button>
-      );
-    }
-  };
-  return column;
-}
+export function ButtonColumn(label, variant, callback, testid) {}
 
 
killedBy: OurTable tests renders an empty table without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
src/main/components/OurTable.js:110:25
   const column = {
     Header: label,
     id: label,
-    Cell: ({ cell }) => {
-      const isHexColor = isValidHexColor(variant);
-      
-      const buttonProps = isHexColor 
-        ? { style: { backgroundColor: variant, color: getContrastYIQ(variant) } } 
-        : { variant };
-
-      return (
-        <Button
-          {...buttonProps}
-          onClick={() => callback(cell)}
-          data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-        >
-          {label}
-        </Button>
-      );
-    }
+    Cell: ({ cell }) => {}
   };
   return column;
killedBy: OurTable tests TestHrefButtonColumn works as it should
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
src/main/components/OurTable.js:114:20
       const isHexColor = isValidHexColor(variant);
       
       const buttonProps = isHexColor 
-        ? { style: { backgroundColor: variant, color: getContrastYIQ(variant) } } 
+        ? { style: {} } 
         : { variant };
 
killedBy: OurTable tests Button with hex color code appears with correct style and is clickable
statusReason: Error: expect(element).toHaveStyle()

- Expected

- background-color: rgb(76, 175, 80);
+ background-color: ButtonFace;

[Killed] ObjectLiteral
src/main/components/OurTable.js:115:11
       
       const buttonProps = isHexColor 
         ? { style: { backgroundColor: variant, color: getContrastYIQ(variant) } } 
-        : { variant };
+        : {};
 
       return (
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn btn-primary

[Timeout] ArrowFunction
src/main/components/OurTable.js:120:20
       return (
         <Button
           {...buttonProps}
-          onClick={() => callback(cell)}
+          onClick={() => undefined}
           data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
         >

[Killed] BlockStatement
src/main/components/OurTable.js:132:42
 }
 
 
-export function getContrastYIQ(hexcolor) {
-  hexcolor = hexcolor.replace("#", "");
-  const r = parseInt(hexcolor.substr(0, 2), 16);
-  const g = parseInt(hexcolor.substr(2, 2), 16);
-  const b = parseInt(hexcolor.substr(4, 2), 16);
-  const yiq = ((r * 299) + (g * 587) + (b * 114)) / 1000;
-  return yiq >= 128.0020 ? 'black' : 'white';
-}
+export function getContrastYIQ(hexcolor) {}
 
 
killedBy: OurTable tests Button with hex color code appears with correct style and is clickable
statusReason: Error: expect(element).toHaveStyle()

- Expected

- color: ;
+ color: ButtonText;

[Killed] MethodExpression
src/main/components/OurTable.js:134:22
 
 export function getContrastYIQ(hexcolor) {
   hexcolor = hexcolor.replace("#", "");
-  const r = parseInt(hexcolor.substr(0, 2), 16);
+  const r = parseInt(hexcolor, 16);
   const g = parseInt(hexcolor.substr(2, 2), 16);
   const b = parseInt(hexcolor.substr(4, 2), 16);
killedBy: getContrastYIQ correctly calculates contrast for color with distinct red component
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "white"
Received: "black"

[Killed] MethodExpression
src/main/components/OurTable.js:135:22
 export function getContrastYIQ(hexcolor) {
   hexcolor = hexcolor.replace("#", "");
   const r = parseInt(hexcolor.substr(0, 2), 16);
-  const g = parseInt(hexcolor.substr(2, 2), 16);
+  const g = parseInt(hexcolor, 16);
   const b = parseInt(hexcolor.substr(4, 2), 16);
   const yiq = ((r * 299) + (g * 587) + (b * 114)) / 1000;
killedBy: getContrastYIQ correctly calculates contrast for color with distinct blue component
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "white"
Received: "black"

[Killed] MethodExpression
src/main/components/OurTable.js:136:22
   hexcolor = hexcolor.replace("#", "");
   const r = parseInt(hexcolor.substr(0, 2), 16);
   const g = parseInt(hexcolor.substr(2, 2), 16);
-  const b = parseInt(hexcolor.substr(4, 2), 16);
+  const b = parseInt(hexcolor, 16);
   const yiq = ((r * 299) + (g * 587) + (b * 114)) / 1000;
   return yiq >= 128.0020 ? 'black' : 'white';
killedBy: getContrastYIQ correctly calculates contrast for color with distinct red component
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "white"
Received: "black"

[Killed] ArithmeticOperator
src/main/components/OurTable.js:137:29
   const r = parseInt(hexcolor.substr(0, 2), 16);
   const g = parseInt(hexcolor.substr(2, 2), 16);
   const b = parseInt(hexcolor.substr(4, 2), 16);
-  const yiq = ((r * 299) + (g * 587) + (b * 114)) / 1000;
+  const yiq = ((r * 299) + (g / 587) + (b * 114)) / 1000;
   return yiq >= 128.0020 ? 'black' : 'white';
 }
killedBy: OurTable tests getContrastYIQ returns 'black' for light background colors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "black"
Received: "white"

[Killed] ArithmeticOperator
src/main/components/OurTable.js:137:15
   const r = parseInt(hexcolor.substr(0, 2), 16);
   const g = parseInt(hexcolor.substr(2, 2), 16);
   const b = parseInt(hexcolor.substr(4, 2), 16);
-  const yiq = ((r * 299) + (g * 587) + (b * 114)) / 1000;
+  const yiq = (r * 299 + g * 587 + b * 114) * 1000;
   return yiq >= 128.0020 ? 'black' : 'white';
 }
killedBy: getContrastYIQ correctly calculates contrast for color with distinct blue component
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "white"
Received: "black"

[Killed] ConditionalExpression
src/main/components/OurTable.js:138:10
   const g = parseInt(hexcolor.substr(2, 2), 16);
   const b = parseInt(hexcolor.substr(4, 2), 16);
   const yiq = ((r * 299) + (g * 587) + (b * 114)) / 1000;
-  return yiq >= 128.0020 ? 'black' : 'white';
+  return true ? 'black' : 'white';
 }
 
killedBy: OurTable tests getContrastYIQ returns 'white' for dark background colors
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "white"
Received: "black"

[Killed] EqualityOperator
src/main/components/OurTable.js:138:10
   const g = parseInt(hexcolor.substr(2, 2), 16);
   const b = parseInt(hexcolor.substr(4, 2), 16);
   const yiq = ((r * 299) + (g * 587) + (b * 114)) / 1000;
-  return yiq >= 128.0020 ? 'black' : 'white';
+  return yiq > 128.0020 ? 'black' : 'white';
 }
 
killedBy: getContrastYIQ returns "black" for YIQ exactly at 128
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "black"
Received: "white"

[Killed] ObjectLiteral
src/main/components/OurTable.js:144:18
 
 
 export function HrefButtonColumn(label, variant, href, testid) {
-  const column = {
-    Header: label,
-    id: label,
-    Cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        href={`${href}`}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    )
-  }
+  const column = {}
   return column;
 }
killedBy: OurTable tests renders an empty table without crashing
statusReason: Error: A column ID (or string accessor) is required!
