[Killed] StringLiteral
main/components/School/SchoolTable.js:49:22
              accessor: 'termDescription',
          },
          {
-             Header: 'TermError',
+             Header: "",
              accessor: 'termError',
          },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: TermError. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;

[Killed] StringLiteral
main/components/School/SchoolTable.js:50:24
          },
          {
              Header: 'TermError',
-             accessor: 'termError',
+             accessor: "",
          },
      ];
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolTable-cell-row-0-col-termError"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/School/SchoolTable.js:55:44
      ];
 
      if (hasRole(currentUser, "ROLE_ADMIN")) {
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "SchoolTable"));
+         columns.push(ButtonColumn("Edit", "", editCallback, "SchoolTable"));
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "SchoolTable"));
      }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/School/SchoolTable.js:55:36
      ];
 
      if (hasRole(currentUser, "ROLE_ADMIN")) {
-         columns.push(ButtonColumn("Edit", "primary", editCallback, "SchoolTable"));
+         columns.push(ButtonColumn("", "primary", editCallback, "SchoolTable"));
          columns.push(ButtonColumn("Delete", "danger", deleteCallback, "SchoolTable"));
      }
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/School/SchoolTable.js:56:72
 
      if (hasRole(currentUser, "ROLE_ADMIN")) {
          columns.push(ButtonColumn("Edit", "primary", editCallback, "SchoolTable"));
-         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "SchoolTable"));
+         columns.push(ButtonColumn("Delete", "danger", deleteCallback, ""));
      }
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchoolTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/School/SchoolTable.js:56:36
 
      if (hasRole(currentUser, "ROLE_ADMIN")) {
          columns.push(ButtonColumn("Edit", "primary", editCallback, "SchoolTable"));
-         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "SchoolTable"));
+         columns.push(ButtonColumn("", "danger", deleteCallback, "SchoolTable"));
      }
 
killedBy: UserTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
