[Killed] BlockStatement
main/components/Staff/StaffTable.js:5:48
 import OurTable from "main/components/OurTable"
 
 
- export default function StaffTable({ staff }) {
-
-     // Stryker disable next-line all : TODO try to make a good test for this
-
-     const columns = [
-         {
-             Header: 'id',
-             accessor: 'id',
-         },
-         {
-             Header: 'courseId',
-             accessor: 'courseId',
-         },
-         {
-             Header: 'githubId',
-             accessor: 'githubId',
-         },
-   
-     ];
-
-     return <OurTable
-         data={staff}
-         columns={columns}
-         testid={"StaffTable"} />;
-    };
+ export default function StaffTable({ staff }) {};
killedBy: StaffTable tests Has the expected column headers and content for ordinary user
statusReason: Error: StaffTable(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Staff/StaffTable.js:15:22
              accessor: 'id',
          },
          {
-             Header: 'courseId',
+             Header: "",
              accessor: 'courseId',
          },
killedBy: StaffTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: courseId. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; m

[Killed] StringLiteral
main/components/Staff/StaffTable.js:16:24
          },
          {
              Header: 'courseId',
-             accessor: 'courseId',
+             accessor: "",
          },
          {
killedBy: StaffTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
