[Killed] ConditionalExpression
main/components/Users/UsersTable.js:30:13
 
     // Stryker disable next-line all : TODO try to make a good test for this
     const toggleAdminCallback = async(cell) => {
-        if (window.confirm("Are you sure you want to toggle the admin status for this user?")) {
+        if (true) {
             toggleAdminMutation.mutate(cell);
         }
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to toggle the admin status for this user?"

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:30:13
 
     // Stryker disable next-line all : TODO try to make a good test for this
     const toggleAdminCallback = async(cell) => {
-        if (window.confirm("Are you sure you want to toggle the admin status for this user?")) {
+        if (false) {
             toggleAdminMutation.mutate(cell);
         }
killedBy: AdminUsersPage tests user table toggle admin tests
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to toggle the admin status for this user?"

Number of calls: 0

<html>
  <head />

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:56:13
     // Stryker disable next-line all : TODO try to make a good test for this
 
     const toggleInstructorCallback = async(cell) => {
-        if (window.confirm("Are you sure you want to toggle the instructor status for this user?")) {
+        if (false) {
             toggleInstructorMutation.mutate(cell);
         }
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:56:13
     // Stryker disable next-line all : TODO try to make a good test for this
 
     const toggleInstructorCallback = async(cell) => {
-        if (window.confirm("Are you sure you want to toggle the instructor status for this user?")) {
+        if (true) {
             toggleInstructorMutation.mutate(cell);
         }
killedBy: AdminUsersPage tests user table toggle instructor tests
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Are you sure you want to toggle the instructor status for this user?"

Number of calls: 0

[Killed] StringLiteral
main/components/Users/UsersTable.js:69:23
         },
         {
             Header: 'githubLogin',
-            accessor: 'githubLogin', // accessor is the "key" in the data
+            accessor: "", // accessor is the "key" in the data
         },
         {
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  cgaucho
Received:

[Killed] ArrayDeclaration
main/components/Users/UsersTable.js:96:26
         },
     ];
 
-    const buttonColumn = [
-        ...columns,
-        ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
-        ButtonColumn("toggle-instructor", "primary", toggleInstructorCallback, "UsersTable")
-    ]
+    const buttonColumn = []
     return <OurTable
         data={users}
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: githubId. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; m

[Killed] StringLiteral
main/components/Users/UsersTable.js:99:80
     const buttonColumn = [
         ...columns,
         ButtonColumn("toggle-admin", "primary", toggleAdminCallback, "UsersTable"),
-        ButtonColumn("toggle-instructor", "primary", toggleInstructorCallback, "UsersTable")
+        ButtonColumn("toggle-instructor", "primary", toggleInstructorCallback, "")
     ]
     return <OurTable
killedBy: UserTable tests Has the expected column headers and content as admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-toggle-instructor-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
