[Killed] BooleanLiteral
src/main/pages/HomePage.js:19:25
 
     const greeting = getPartOfDayGreeting();
 
-    if (!currentUser || !currentUser.loggedIn) {
+    if (!currentUser || currentUser.loggedIn) {
         return (
             <div data-testid={"HomePage-main-div"}>
killedBy: HomePage tests expected CSS properties
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] LogicalOperator
src/main/pages/HomePage.js:19:9
 
     const greeting = getPartOfDayGreeting();
 
-    if (!currentUser || !currentUser.loggedIn) {
+    if (!currentUser && !currentUser.loggedIn) {
         return (
             <div data-testid={"HomePage-main-div"}>
killedBy: HomePage tests expected CSS properties
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] ObjectLiteral
src/main/pages/HomePage.js:23:61
         return (
             <div data-testid={"HomePage-main-div"}>
                 <BasicLayout>
-                    <h1 data-testid="homePage-title" style={{ fontSize: "75px", borderRadius: "7px", backgroundColor: "white", opacity: ".9" }} className="text-center border-0 my-3">
+                    <h1 data-testid="homePage-title" style={{}} className="text-center border-0 my-3">
                         {greeting}, cgaucho
                     </h1>
killedBy: HomePage tests expected CSS properties
statusReason: Error: expect(element).toHaveAttribute("style", "font-size: 75px; border-radius: 7px; background-color: white; opacity: 0.9;") // element.getAttribute("style") === "font-size: 75px; border-radius: 7px; background-color: white; opacity: 0.9;"

Expected the element to have attribute:
  style="font-size: 75px; border-radius: 7px; background-color: white; opacity: 0.9;"
Received:
  null

[Killed] StringLiteral
src/main/pages/HomePage.js:23:73
         return (
             <div data-testid={"HomePage-main-div"}>
                 <BasicLayout>
-                    <h1 data-testid="homePage-title" style={{ fontSize: "75px", borderRadius: "7px", backgroundColor: "white", opacity: ".9" }} className="text-center border-0 my-3">
+                    <h1 data-testid="homePage-title" style={{ fontSize: "", borderRadius: "7px", backgroundColor: "white", opacity: ".9" }} className="text-center border-0 my-3">
                         {greeting}, cgaucho
                     </h1>
killedBy: HomePage tests expected CSS properties
statusReason: Error: expect(element).toHaveAttribute("style", "font-size: 75px; border-radius: 7px; background-color: white; opacity: 0.9;") // element.getAttribute("style") === "font-size: 75px; border-radius: 7px; background-color: white; opacity: 0.9;"

Expected the element to have attribute:
  style="font-size: 75px; border-radius: 7px; background-color: white; opacity: 0.9;"
Received:
  style="border-radiu
