[Killed] BlockStatement
main/components/Courses/dateValidation.js:1:43
-export function enableEndDateValidation() {
-    const startDateInput = document.getElementById("startDate");
-    const endDateInput = document.getElementById("endDate");
-
-    // Function to update the min attribute of the end date input
-    const updateEndDateMin = () => {
-        endDateInput.min = startDateInput.value;
-    };
-
-    // Add event listener to the start date input field
-    startDateInput.addEventListener("change", updateEndDateMin);
-
-    // Call updateEndDateMin initially
-    updateEndDateMin();
-}
+export function enableEndDateValidation() {}
 
killedBy: enableEndDateValidation end date input min attribute is updated on start date change
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-03-01"
Received: ""

[Killed] BlockStatement
main/components/Courses/dateValidation.js:6:36
     const endDateInput = document.getElementById("endDate");
 
     // Function to update the min attribute of the end date input
-    const updateEndDateMin = () => {
-        endDateInput.min = startDateInput.value;
-    };
+    const updateEndDateMin = () => {};
 
     // Add event listener to the start date input field
killedBy: enableEndDateValidation end date input min attribute is updated on start date change
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "2024-03-01"
Received: ""
