[Killed] BlockStatement
main/components/Utils/StaffUtils.js:8:48
      toast(message);
  }
 
- export function cellToAxiosParamsDelete(cell) {
-     return {
-         url: "/api/courses/staff",
-         method: "DELETE",
-         params: {
-             id: cell.row.values.id
-         }
-     }
-}
+ export function cellToAxiosParamsDelete(cell) {}
killedBy: CoursesUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 1}, "url": "/api/courses/staff"}
Received: undefined

[Killed] StringLiteral
main/components/Utils/StaffUtils.js:11:18
  export function cellToAxiosParamsDelete(cell) {
      return {
          url: "/api/courses/staff",
-         method: "DELETE",
+         method: "",
          params: {
              id: cell.row.values.id
killedBy: CoursesUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",
