[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:6:48
 import { Form } from 'react-bootstrap';
 
 function DropdownOption({ label, isSelected, onClickFunc, testid, rawKey, isGhost }) {
-    const [isHovered, setIsHovered] = useState(false);
+    const [isHovered, setIsHovered] = useState(true);
     const handleMouseEnter = () => {
         setIsHovered(true);
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement with autocomplete off
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: white;

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:7:36
 
 function DropdownOption({ label, isSelected, onClickFunc, testid, rawKey, isGhost }) {
     const [isHovered, setIsHovered] = useState(false);
-    const handleMouseEnter = () => {
-        setIsHovered(true);
-    };
+    const handleMouseEnter = () => {};
     const handleMouseLeave = () => {
         setIsHovered(false);
killedBy: OurAddDropdownForm Tests selection color changes over hovering
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: lightgreen;

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:8:22
 function DropdownOption({ label, isSelected, onClickFunc, testid, rawKey, isGhost }) {
     const [isHovered, setIsHovered] = useState(false);
     const handleMouseEnter = () => {
-        setIsHovered(true);
+        setIsHovered(false);
     };
     const handleMouseLeave = () => {
killedBy: OurAddDropdownForm Tests selection color changes over hovering
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: lightgreen;

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:10:36
     const handleMouseEnter = () => {
         setIsHovered(true);
     };
-    const handleMouseLeave = () => {
-        setIsHovered(false);
-    };
+    const handleMouseLeave = () => {};
     // Stryker disable all
     const divStyle = {
killedBy: OurAddDropdownForm Tests selection color changes over hovering
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: white;

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:11:22
         setIsHovered(true);
     };
     const handleMouseLeave = () => {
-        setIsHovered(false);
+        setIsHovered(true);
     };
     // Stryker disable all
killedBy: OurAddDropdownForm Tests selection color changes over hovering
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: white;

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:23:9
     };
     // Stryker restore all
     let mainOption;
-    if (!isSelected) {
+    if (isSelected) {
         let altStyle = divStyle;
         if(isGhost){
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: green;

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:23:9
     };
     // Stryker restore all
     let mainOption;
-    if (!isSelected) {
+    if (true) {
         let altStyle = divStyle;
         if(isGhost){
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: green;

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:25:12
     let mainOption;
     if (!isSelected) {
         let altStyle = divStyle;
-        if(isGhost){
+        if(true){
             altStyle['backgroundColor'] = 'lightgreen';
         }
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement with autocomplete off
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: white;

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:25:20
     let mainOption;
     if (!isSelected) {
         let altStyle = divStyle;
-        if(isGhost){
-            altStyle['backgroundColor'] = 'lightgreen';
-        }
+        if(isGhost){}
         mainOption = (
             <div
killedBy: OurAddDropdownForm Tests selection color changes over hovering
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: lightgreen;

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:40:12
                 {label}
             </div>
         );
-    } else {
-        // Stryker disable all
-        let altStyle = divStyle;
-        altStyle['backgroundColor'] = 'green';
-        altStyle['color'] = 'white';
-        // Stryker restore all
-        mainOption = (
-            <div key={rawKey} data-testid={testid} style={altStyle} onClick={onClickFunc}>
-                {label}
-            </div>
-        );
-    }
+    } else {}
     return <div>{mainOption}</div>;
 }
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement
statusReason: Error: Unable to find an element by: [data-testid="testid-dropdown-form-option-0"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Timeout] StringLiteral
src/main/components/OurAddDropdownForm.js:59:14
     content,
     label,
     basis = null,
-    testId = 'testid',
+    testId = "",
     autocomplete=true,
     onChangeFunc = null,

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:60:18
     label,
     basis = null,
     testId = 'testid',
-    autocomplete=true,
+    autocomplete=false,
     onChangeFunc = null,
 }) {
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: green;

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:93:63
     // Stryker restore all
 
     const [selectedContent, changeSelectedContent] = useState(basis);
-    const [userTypedContent, changeUserTypContent] = useState(basis !== null ? basis.label : "");
+    const [userTypedContent, changeUserTypContent] = useState(false ? basis.label : "");
     const [showingDropdown, changeShowingDropdown] = useState(false);
     const [validationStyle, changeValidationStyle] = useState(autocomplete ? {} : {cursor: 'pointer', 'caretColor': 'transparent'});
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement
statusReason: Error: expect(element).toHaveAttribute("value", "click me") // element.getAttribute("value") === "click me"

Expected the element to have attribute:
  value="click me"
Received:
  value=""

[Timeout] EqualityOperator
src/main/components/OurAddDropdownForm.js:93:63
     // Stryker restore all
 
     const [selectedContent, changeSelectedContent] = useState(basis);
-    const [userTypedContent, changeUserTypContent] = useState(basis !== null ? basis.label : "");
+    const [userTypedContent, changeUserTypContent] = useState(basis === null ? basis.label : "");
     const [showingDropdown, changeShowingDropdown] = useState(false);
     const [validationStyle, changeValidationStyle] = useState(autocomplete ? {} : {cursor: 'pointer', 'caretColor': 'transparent'});

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:94:63
 
     const [selectedContent, changeSelectedContent] = useState(basis);
     const [userTypedContent, changeUserTypContent] = useState(basis !== null ? basis.label : "");
-    const [showingDropdown, changeShowingDropdown] = useState(false);
+    const [showingDropdown, changeShowingDropdown] = useState(true);
     const [validationStyle, changeValidationStyle] = useState(autocomplete ? {} : {cursor: 'pointer', 'caretColor': 'transparent'});
     // the user can press enter to autocomplete
killedBy: OurAddDropdownForm Tests renders an dropdown element without showing options if not selected
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:116:32
     const filterPrefix = (prefix) => {
         // filter the dropdown to only have the matching prefix options
         const prefixedContent = [];
-        let isValidSelection = false;
+        let isValidSelection = true;
         let overflow = true;
         let first = true;
killedBy: OurAddDropdownForm Tests prefix renders only a portion of options after changing prefix and the initialElement is no longer selected
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: lightgreen;

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:117:24
         // filter the dropdown to only have the matching prefix options
         const prefixedContent = [];
         let isValidSelection = false;
-        let overflow = true;
+        let overflow = false;
         let first = true;
 
killedBy: OurAddDropdownForm Tests prefix removes all options and causes red text
statusReason: Error: expect(element).toHaveStyle()

- Expected

- color: red;

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:118:21
         const prefixedContent = [];
         let isValidSelection = false;
         let overflow = true;
-        let first = true;
+        let first = false;
 
         for(let i = 0; i < content.length; ++i){
killedBy: OurAddDropdownForm Tests prefix renders only a portion of options 2
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: lightgreen;

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:120:24
         let overflow = true;
         let first = true;
 
-        for(let i = 0; i < content.length; ++i){
+        for(let i = 0; false; ++i){
             if(content[i].label.startsWith(prefix)){
                 overflow = false;
killedBy: OurAddDropdownForm Tests selection changes after clicking on an option
statusReason: Error: Unable to find an element by: [data-testid="testid-dropdown-form-option-0"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:120:48
         let overflow = true;
         let first = true;
 
-        for(let i = 0; i < content.length; ++i){
-            if(content[i].label.startsWith(prefix)){
-                overflow = false;
-                // the first element will be "semihovered" i.e. the user can press enter
-                // autofill the text automatically
-                if(first){
-                    changeGhostContent(content[i]);
-                    first = false;
-                }
-
-                // a direct match is found
-                // NOTE: THIS ASSUMES THAT ALL CONTENT IS UNIQUE
-                if(content[i].label === prefix){
-                    changeSelectedContent(content[i]);
-                    isValidSelection = true;
-                }
-
-                prefixedContent.push(content[i]);
-            }
-        }
+        for(let i = 0; i < content.length; ++i){}
         // if there was no direct match then there is no selectedContent
         if(!isValidSelection){
killedBy: OurAddDropdownForm Tests selection changes after clicking on an option
statusReason: Error: Unable to find an element by: [data-testid="testid-dropdown-form-option-0"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:121:16
         let first = true;
 
         for(let i = 0; i < content.length; ++i){
-            if(content[i].label.startsWith(prefix)){
+            if(true){
                 overflow = false;
                 // the first element will be "semihovered" i.e. the user can press enter
killedBy: OurAddDropdownForm Tests selection changes after clicking on an option
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: green;

[Killed] MethodExpression
src/main/components/OurAddDropdownForm.js:121:16
         let first = true;
 
         for(let i = 0; i < content.length; ++i){
-            if(content[i].label.startsWith(prefix)){
+            if(content[i].label.endsWith(prefix)){
                 overflow = false;
                 // the first element will be "semihovered" i.e. the user can press enter
killedBy: OurAddDropdownForm Tests prefix renders only a portion of options
statusReason: Error: Unable to find an element by: [data-testid="testid-dropdown-form-option-0"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:122:28
 
         for(let i = 0; i < content.length; ++i){
             if(content[i].label.startsWith(prefix)){
-                overflow = false;
+                overflow = true;
                 // the first element will be "semihovered" i.e. the user can press enter
                 // autofill the text automatically
killedBy: OurAddDropdownForm Tests selection changes after clicking on an option
statusReason: TypeError: Cannot read properties of null (reading 'key')

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:125:20
                 overflow = false;
                 // the first element will be "semihovered" i.e. the user can press enter
                 // autofill the text automatically
-                if(first){
+                if(true){
                     changeGhostContent(content[i]);
                     first = false;
killedBy: OurAddDropdownForm Tests prefix renders only a portion of options
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: lightgreen;

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:125:26
                 overflow = false;
                 // the first element will be "semihovered" i.e. the user can press enter
                 // autofill the text automatically
-                if(first){
-                    changeGhostContent(content[i]);
-                    first = false;
-                }
+                if(first){}
 
                 // a direct match is found
killedBy: OurAddDropdownForm Tests prefix renders only a portion of options 2
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: lightgreen;

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:127:29
                 // autofill the text automatically
                 if(first){
                     changeGhostContent(content[i]);
-                    first = false;
+                    first = true;
                 }
 
killedBy: OurAddDropdownForm Tests prefix renders only a portion of options
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: lightgreen;

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:132:48
 
                 // a direct match is found
                 // NOTE: THIS ASSUMES THAT ALL CONTENT IS UNIQUE
-                if(content[i].label === prefix){
-                    changeSelectedContent(content[i]);
-                    isValidSelection = true;
-                }
+                if(content[i].label === prefix){}
 
                 prefixedContent.push(content[i]);
killedBy: OurAddDropdownForm Tests selection changes after clicking on an option
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: green;

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:132:20
 
                 // a direct match is found
                 // NOTE: THIS ASSUMES THAT ALL CONTENT IS UNIQUE
-                if(content[i].label === prefix){
+                if(true){
                     changeSelectedContent(content[i]);
                     isValidSelection = true;
killedBy: OurAddDropdownForm Tests prefix renders only a portion of options
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: white;

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:134:40
                 // NOTE: THIS ASSUMES THAT ALL CONTENT IS UNIQUE
                 if(content[i].label === prefix){
                     changeSelectedContent(content[i]);
-                    isValidSelection = true;
+                    isValidSelection = false;
                 }
 
killedBy: OurAddDropdownForm Tests selection changes after clicking on an option
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: green;

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:141:12
             }
         }
         // if there was no direct match then there is no selectedContent
-        if(!isValidSelection){
+        if(isValidSelection){
             changeSelectedContent(null);
         } 
killedBy: OurAddDropdownForm Tests selection changes after clicking on an option
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: green;

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:141:30
             }
         }
         // if there was no direct match then there is no selectedContent
-        if(!isValidSelection){
-            changeSelectedContent(null);
-        } 
+        if(!isValidSelection){} 
         // no matches or prefix matches
         if(overflow){
killedBy: OurAddDropdownForm Tests prefix renders only a portion of options after changing prefix and the initialElement is no longer selected
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: lightgreen;

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:145:12
             changeSelectedContent(null);
         } 
         // no matches or prefix matches
-        if(overflow){
+        if(true){
             changeValidationStyle({color:"red"});
             changeGhostContent(null);
killedBy: OurAddDropdownForm Tests selection changes after clicking on an option
statusReason: TypeError: Cannot read properties of null (reading 'key')

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:145:21
             changeSelectedContent(null);
         } 
         // no matches or prefix matches
-        if(overflow){
-            changeValidationStyle({color:"red"});
-            changeGhostContent(null);
-        } else {
+        if(overflow){} else {
             changeValidationStyle({});
         }
killedBy: OurAddDropdownForm Tests prefix removes all options and causes red text
statusReason: Error: expect(element).toHaveStyle()

- Expected

- color: red;

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:148:16
         if(overflow){
             changeValidationStyle({color:"red"});
             changeGhostContent(null);
-        } else {
-            changeValidationStyle({});
-        }
+        } else {}
         changeFilteredContent(prefixedContent);
     };
killedBy: OurAddDropdownForm Tests red text removed on proper prefix
statusReason: Error: expect(element).not.toHaveStyle()

Compared values have no visual difference.

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:154:41
         changeFilteredContent(prefixedContent);
     };
 
-    const internalOnChange = (event) => {
-        if(autocomplete){
-            // grab the userText 
-            const newSelectedContent = event.target.value;
-            changeUserTypContent(newSelectedContent);
-            filterPrefix(newSelectedContent);
-        }
-
-        if (onChangeFunc) {
-            onChangeFunc(event);
-        }
-    };
+    const internalOnChange = (event) => {};
     const fillGhost = (event) => {
         if(event.key === "Enter" && ghostContent !== null) {
killedBy: OurAddDropdownForm Tests onChangeFunc is called on typing
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:155:25
     };
 
     const internalOnChange = (event) => {
-        if(autocomplete){
-            // grab the userText 
-            const newSelectedContent = event.target.value;
-            changeUserTypContent(newSelectedContent);
-            filterPrefix(newSelectedContent);
-        }
+        if(autocomplete){}
 
         if (onChangeFunc) {
killedBy: OurAddDropdownForm Tests prefix renders only a portion of options
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div data-testid="testid-dropdown-form-option-2" style="background-color: white; transition: background-color 0.25s ease; padding-left: 2px; padding-right: 2px; cursor: pointer;">pick me!</div> instead

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:155:12
     };
 
     const internalOnChange = (event) => {
-        if(autocomplete){
+        if(true){
             // grab the userText 
             const newSelectedContent = event.target.value;
killedBy: OurAddDropdownForm Tests prefix doesn't renders only a portion of options with autocomplete off 2
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="testid-dropdown-form-option-2"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:162:13
             filterPrefix(newSelectedContent);
         }
 
-        if (onChangeFunc) {
+        if (true) {
             onChangeFunc(event);
         }
killedBy: OurAddDropdownForm Tests renders correctly with null onChangeFunc
statusReason: TypeError: onChangeFunc is not a function

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:162:27
             filterPrefix(newSelectedContent);
         }
 
-        if (onChangeFunc) {
-            onChangeFunc(event);
-        }
+        if (onChangeFunc) {}
     };
     const fillGhost = (event) => {
killedBy: OurAddDropdownForm Tests onChangeFunc is called on typing
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:166:34
             onChangeFunc(event);
         }
     };
-    const fillGhost = (event) => {
-        if(event.key === "Enter" && ghostContent !== null) {
-            changeUserTypContent(ghostContent.label);
-            filterPrefix(ghostContent.label);
-            changeShowingDropdown(false);
-        } else {
-            changeShowingDropdown(true);
-        }
-    };
+    const fillGhost = (event) => {};
     return (
         <div>
killedBy: OurAddDropdownForm Tests enter autocompletes and chooses first selection
statusReason: Error: expect(element).toHaveAttribute("value", "choose me") // element.getAttribute("value") === "choose me"

Expected the element to have attribute:
  value="choose me"
Received:
  value="choose"

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:167:12
         }
     };
     const fillGhost = (event) => {
-        if(event.key === "Enter" && ghostContent !== null) {
+        if(true) {
             changeUserTypContent(ghostContent.label);
             filterPrefix(ghostContent.label);
killedBy: OurAddDropdownForm Tests dropdown still shows on keyboard input aside from Enter
statusReason: Error: Unable to find an element by: [data-testid="testid-wrapper"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:167:12
         }
     };
     const fillGhost = (event) => {
-        if(event.key === "Enter" && ghostContent !== null) {
+        if(true && ghostContent !== null) {
             changeUserTypContent(ghostContent.label);
             filterPrefix(ghostContent.label);
killedBy: OurAddDropdownForm Tests dropdown still shows on keyboard input aside from Enter
statusReason: Error: Unable to find an element by: [data-testid="testid-wrapper"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:170:35
         if(event.key === "Enter" && ghostContent !== null) {
             changeUserTypContent(ghostContent.label);
             filterPrefix(ghostContent.label);
-            changeShowingDropdown(false);
+            changeShowingDropdown(true);
         } else {
             changeShowingDropdown(true);
killedBy: OurAddDropdownForm Tests enter autocompletes and chooses first selection
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:171:16
             changeUserTypContent(ghostContent.label);
             filterPrefix(ghostContent.label);
             changeShowingDropdown(false);
-        } else {
-            changeShowingDropdown(true);
-        }
+        } else {}
     };
     return (
killedBy: OurAddDropdownForm Tests dropdown rerenders after autocomplete and nonEnterKey
statusReason: Error: Unable to find an element by: [data-testid="testid-wrapper"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:172:35
             filterPrefix(ghostContent.label);
             changeShowingDropdown(false);
         } else {
-            changeShowingDropdown(true);
+            changeShowingDropdown(false);
         }
     };
killedBy: OurAddDropdownForm Tests dropdown still shows on keyboard input aside from Enter
statusReason: Error: Unable to find an element by: [data-testid="testid-wrapper"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:178:14
     return (
         <div>
             {label}
-            {content.length !== 0 && (
+            {true && (
                 <div>
                     <Form.Control
killedBy: OurAddDropdownForm Tests renders an empty dropdown element with no options
statusReason: Error: Found multiple elements by: [data-testid="testid-test-dropdown-form"]

Here are the matching elements:

<input
  class="form-control"
  data-testid="testid-test-dropdown-form"
  type="text"

[Timeout] EqualityOperator
src/main/components/OurAddDropdownForm.js:178:14
     return (
         <div>
             {label}
-            {content.length !== 0 && (
+            {content.length === 0 && (
                 <div>
                     <Form.Control

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:183:67
                     <Form.Control
                         data-testid={`${testId}-test-dropdown-form`}
                         type="text"
-                        value={autocomplete ? userTypedContent : (selectedContent !== null ? selectedContent.label : "") }
+                        value={autocomplete ? userTypedContent : (true ? selectedContent.label : "") }
                         onChange={internalOnChange}
                         style={validationStyle}
killedBy: OurAddDropdownForm Tests renders empty text with autocomplete off
statusReason: TypeError: Cannot read properties of null (reading 'label')

[Killed] EqualityOperator
src/main/components/OurAddDropdownForm.js:183:67
                     <Form.Control
                         data-testid={`${testId}-test-dropdown-form`}
                         type="text"
-                        value={autocomplete ? userTypedContent : (selectedContent !== null ? selectedContent.label : "") }
+                        value={autocomplete ? userTypedContent : (selectedContent === null ? selectedContent.label : "") }
                         onChange={internalOnChange}
                         style={validationStyle}
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement with autocomplete off
statusReason: Error: expect(element).toHaveAttribute("value", "click me") // element.getAttribute("value") === "click me"

Expected the element to have attribute:
  value="click me"
Received:
  value=""

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:186:40
                         value={autocomplete ? userTypedContent : (selectedContent !== null ? selectedContent.label : "") }
                         onChange={internalOnChange}
                         style={validationStyle}
-                        onFocus={() => {
-                            changeShowingDropdown(true);
-                        }}
+                        onFocus={() => {}}
                         onClick={() => {
                             changeShowingDropdown(true);
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement
statusReason: Error: Unable to find an element by: [data-testid="testid-wrapper"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:187:51
                         onChange={internalOnChange}
                         style={validationStyle}
                         onFocus={() => {
-                            changeShowingDropdown(true);
+                            changeShowingDropdown(false);
                         }}
                         onClick={() => {
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement
statusReason: Error: Unable to find an element by: [data-testid="testid-wrapper"]

<body>
  <div>
    <div>
      empty
      <div>
        <input
