[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:189:40
                         onFocus={() => {
                             changeShowingDropdown(true);
                         }}
-                        onClick={() => {
-                            changeShowingDropdown(true);
-                        }}
+                        onClick={() => {}}
                         onKeyDown={autocomplete ? fillGhost : null}
                     />
killedBy: OurAddDropdownForm Tests selection changes after clicking on an option
statusReason: Error: Unable to find an element by: [data-testid="testid-wrapper"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:190:51
                             changeShowingDropdown(true);
                         }}
                         onClick={() => {
-                            changeShowingDropdown(true);
+                            changeShowingDropdown(false);
                         }}
                         onKeyDown={autocomplete ? fillGhost : null}
killedBy: OurAddDropdownForm Tests selection changes after clicking on an option
statusReason: Error: Unable to find an element by: [data-testid="testid-wrapper"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:196:59
                     />
                     {showingDropdown && (
                         <div data-testid = {`${testId}-wrapper`} style={optionWrapperStyle}>
-                            {filteredContent.map((obj) => {
-                                const key = obj.key;
-                                const innerLabel = obj.label;
-                                const select = () => {
-                                    changeSelectedContent(obj);
-                                    if(autocomplete){
-                                        changeUserTypContent(innerLabel);
-                                        changeGhostContent(obj);
-                                        filterPrefix(innerLabel);
-                                    }
-                                    changeShowingDropdown(false);
-                                };
-                                return (
-                                    <DropdownOption
-                                        testid={`${testId}-dropdown-form-option-${count++}`}
-                                        label={innerLabel}
-                                        isSelected={selectedContent && key === selectedContent.key}
-                                        isGhost={autocomplete ? (key === ghostContent.key) : false}
-                                        rawKey = {key}
-                                        // Stryker disable next-line all
-                                        key ={`${key}-dropdown-option`}
-                                        onClickFunc={select}
-                                    ></DropdownOption>
-                                );
-                            })}
+                            {filteredContent.map((obj) => {})}
                         </div>
                     )}
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement
statusReason: Error: Unable to find an element by: [data-testid="testid-dropdown-form-option-0"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:199:54
                             {filteredContent.map((obj) => {
                                 const key = obj.key;
                                 const innerLabel = obj.label;
-                                const select = () => {
-                                    changeSelectedContent(obj);
-                                    if(autocomplete){
-                                        changeUserTypContent(innerLabel);
-                                        changeGhostContent(obj);
-                                        filterPrefix(innerLabel);
-                                    }
-                                    changeShowingDropdown(false);
-                                };
+                                const select = () => {};
                                 return (
                                     <DropdownOption
killedBy: OurAddDropdownForm Tests options are not rendered after selection
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:201:40
                                 const innerLabel = obj.label;
                                 const select = () => {
                                     changeSelectedContent(obj);
-                                    if(autocomplete){
+                                    if(false){
                                         changeUserTypContent(innerLabel);
                                         changeGhostContent(obj);
killedBy: OurAddDropdownForm Tests selection changes after clicking on an option
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: green;

[Killed] BlockStatement
src/main/components/OurAddDropdownForm.js:201:53
                                 const innerLabel = obj.label;
                                 const select = () => {
                                     changeSelectedContent(obj);
-                                    if(autocomplete){
-                                        changeUserTypContent(innerLabel);
-                                        changeGhostContent(obj);
-                                        filterPrefix(innerLabel);
-                                    }
+                                    if(autocomplete){}
                                     changeShowingDropdown(false);
                                 };
killedBy: OurAddDropdownForm Tests selection changes after clicking on an option
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: green;

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:206:59
                                         changeGhostContent(obj);
                                         filterPrefix(innerLabel);
                                     }
-                                    changeShowingDropdown(false);
+                                    changeShowingDropdown(true);
                                 };
                                 return (
killedBy: OurAddDropdownForm Tests options are not rendered after selection
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] UpdateOperator
src/main/components/OurAddDropdownForm.js:210:83
                                 };
                                 return (
                                     <DropdownOption
-                                        testid={`${testId}-dropdown-form-option-${count++}`}
+                                        testid={`${testId}-dropdown-form-option-${count--}`}
                                         label={innerLabel}
                                         isSelected={selectedContent && key === selectedContent.key}
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement with autocomplete off
statusReason: Error: Unable to find an element by: [data-testid="testid-dropdown-form-option-1"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] StringLiteral
src/main/components/OurAddDropdownForm.js:210:49
                                 };
                                 return (
                                     <DropdownOption
-                                        testid={`${testId}-dropdown-form-option-${count++}`}
+                                        testid={``}
                                         label={innerLabel}
                                         isSelected={selectedContent && key === selectedContent.key}
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement
statusReason: Error: Unable to find an element by: [data-testid="testid-dropdown-form-option-0"]

<body>
  <div>
    <div>
      empty
      <div>
        <input

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:212:53
                                     <DropdownOption
                                         testid={`${testId}-dropdown-form-option-${count++}`}
                                         label={innerLabel}
-                                        isSelected={selectedContent && key === selectedContent.key}
+                                        isSelected={false}
                                         isGhost={autocomplete ? (key === ghostContent.key) : false}
                                         rawKey = {key}
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: green;

[Killed] LogicalOperator
src/main/components/OurAddDropdownForm.js:212:53
                                     <DropdownOption
                                         testid={`${testId}-dropdown-form-option-${count++}`}
                                         label={innerLabel}
-                                        isSelected={selectedContent && key === selectedContent.key}
+                                        isSelected={selectedContent || key === selectedContent.key}
                                         isGhost={autocomplete ? (key === ghostContent.key) : false}
                                         rawKey = {key}
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement with autocomplete off
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: white;

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:213:94
                                         testid={`${testId}-dropdown-form-option-${count++}`}
                                         label={innerLabel}
                                         isSelected={selectedContent && key === selectedContent.key}
-                                        isGhost={autocomplete ? (key === ghostContent.key) : false}
+                                        isGhost={autocomplete ? (key === ghostContent.key) : true}
                                         rawKey = {key}
                                         // Stryker disable next-line all
killedBy: OurAddDropdownForm Tests renders an correctly selected initialElement with autocomplete off
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: white;

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:213:66
                                         testid={`${testId}-dropdown-form-option-${count++}`}
                                         label={innerLabel}
                                         isSelected={selectedContent && key === selectedContent.key}
-                                        isGhost={autocomplete ? (key === ghostContent.key) : false}
+                                        isGhost={autocomplete ? (true) : false}
                                         rawKey = {key}
                                         // Stryker disable next-line all
killedBy: OurAddDropdownForm Tests selection color changes over hovering
statusReason: Error: expect(element).toHaveStyle()

- Expected

- backgroundColor: white;

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:225:14
                     )}
                 </div>
             )}
-            {content.length === 0 && (
-                <div>
-                    <Form.Control
-                        data-testid={`${testId}-test-dropdown-form`}
-                        type="text"
-                        disabled={true}
-                        style={{ cursor: 'not-allowed' }}
-                    />
-                </div>
-            )}
+            {false}
         </div>
     );
killedBy: OurAddDropdownForm Tests renders an empty dropdown element with no options
statusReason: Error: Unable to find an element by: [data-testid="testid-test-dropdown-form"]

<body>
  <div>
    <div>
      empty
    </div>
  </div>

[Killed] ConditionalExpression
src/main/components/OurAddDropdownForm.js:225:14
                     )}
                 </div>
             )}
-            {content.length === 0 && (
-                <div>
-                    <Form.Control
-                        data-testid={`${testId}-test-dropdown-form`}
-                        type="text"
-                        disabled={true}
-                        style={{ cursor: 'not-allowed' }}
-                    />
-                </div>
-            )}
+            {true}
         </div>
     );
killedBy: OurAddDropdownForm Tests renders an empty dropdown element with no options
statusReason: Error: Unable to find an element by: [data-testid="testid-test-dropdown-form"]

<body>
  <div>
    <div>
      empty
    </div>
  </div>

[Killed] BooleanLiteral
src/main/components/OurAddDropdownForm.js:230:35
                     <Form.Control
                         data-testid={`${testId}-test-dropdown-form`}
                         type="text"
-                        disabled={true}
+                        disabled={false}
                         style={{ cursor: 'not-allowed' }}
                     />
killedBy: OurAddDropdownForm Tests empty content list is properly disabled
statusReason: Error: expect(element).toHaveAttribute("disabled") // element.hasAttribute("disabled")

Expected the element to have attribute:
  disabled
Received:
  null

[Killed] ObjectLiteral
src/main/components/OurAddDropdownForm.js:231:32
                         data-testid={`${testId}-test-dropdown-form`}
                         type="text"
                         disabled={true}
-                        style={{ cursor: 'not-allowed' }}
+                        style={{}}
                     />
                 </div>
killedBy: OurAddDropdownForm Tests empty content list is properly disabled
statusReason: Error: expect(element).toHaveStyle()

- Expected

- cursor: not-allowed;
+ cursor: auto;
