[Killed] ArrayDeclaration
main/components/School/SchoolDropdown.js:15:26
       []
     );
 
-    const fixedSchools = [];
+    const fixedSchools = ["Stryker was here"];
     for(let i = 0; i < schools.length; ++i){
         fixedSchools.push({
killedBy: SchoolDropdown renders three schools correctly
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div data-testid="school-dropdown-dropdown-form-option-3" style="background-color: white; transition: background-color 0.25s ease; padding-left: 2px; padding-right: 2px; cursor: pointer;">University of Minnesota</div> instead

[Killed] UpdateOperator
main/components/School/SchoolDropdown.js:16:40
     );
 
     const fixedSchools = [];
-    for(let i = 0; i < schools.length; ++i){
+    for(let i = 0; i < schools.length; --i){
         fixedSchools.push({
             label: schools[i].name,
killedBy: SchoolDropdown renders three schools correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
main/components/School/SchoolDropdown.js:16:44
     );
 
     const fixedSchools = [];
-    for(let i = 0; i < schools.length; ++i){
-        fixedSchools.push({
-            label: schools[i].name,
-            key: schools[i].name,
-        });
-    }
+    for(let i = 0; i < schools.length; ++i){}
 
     return (
killedBy: SchoolDropdown renders three schools correctly
statusReason: Error: Unable to find an element by: [data-testid="school-dropdown-wrapper"]

<body>
  <div>
    <div>
      Name
      <div>
        <input

[Killed] BooleanLiteral
main/components/School/SchoolDropdown.js:29:27
             label="Name"
             testId="school-dropdown"
             basis={null}
-            autocomplete={true}
+            autocomplete={false}
         ></OurAddDropdownForm>
     )
killedBy: SchoolDropdown renders three schools correctly after selecting an option
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  UC Santa Barbara
Received:
  UC San Diego
