[Killed] LogicalOperator
main/components/Staff/StaffForm.js:64:16
               {...register("githubId", { required: true })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.githubId && 'GithubId is required.'}
+              {errors.githubId || 'GithubId is required.'}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: StaffForm tests renders correctly when passing in a Staff
statusReason: TestingLibraryElementError: Found multiple elements with the text: /Id/

Here are the matching elements:

<label
  class="form-label"
  for="id"
>

[Killed] ConditionalExpression
main/components/Staff/StaffForm.js:64:16
               {...register("githubId", { required: true })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.githubId && 'GithubId is required.'}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: StaffForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /GithubId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
