[Killed] StringLiteral
main/components/Student/StudentTable.js:20:22
          },
          {
             Header: 'studentId',
-            accessor:'studentId',
+            accessor:"",
          },
          {
killedBy: StudentTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  12345
Received:

[Killed] StringLiteral
main/components/Student/StudentTable.js:23:22
             accessor:'studentId',
          },
          {
-             Header: 'firstName',
+             Header: "",
              accessor: 'firstName',
          },
killedBy: StudentTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: firstName. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block;

[Killed] StringLiteral
main/components/Student/StudentTable.js:24:24
          },
          {
              Header: 'firstName',
-             accessor: 'firstName',
+             accessor: "",
          },
          {
killedBy: StudentTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  John
Received:

[Killed] ObjectLiteral
main/components/Student/StudentTable.js:26:10
              Header: 'firstName',
              accessor: 'firstName',
          },
-         {
-            Header: 'lastName',
-            accessor: 'lastName',
-         },
+         {},
          {
             Header: 'email',
killedBy: StudentTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Student/StudentTable.js:27:21
              accessor: 'firstName',
          },
          {
-            Header: 'lastName',
+            Header: "",
             accessor: 'lastName',
          },
killedBy: StudentTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: lastName. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; m

[Killed] StringLiteral
main/components/Student/StudentTable.js:43:18
      return <OurTable
          data={students}
          columns={columns}
-         testid={"StudentTable"} />;
+         testid={""} />;
     };
killedBy: StudentTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="StudentTable-cell-row-0-col-courseId"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
