[Killed] StringLiteral
src/main/pages/HomePage.js:8:23
 const styles = {
     greeting: {
         fontSize: "75px",
-        borderRadius: "7px",
+        borderRadius: "",
         backgroundColor: "white",
         opacity: ".9",
killedBy: HomePage tests expected CSS properties
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: white;
- border-radius: 7px;
  font-size: 75px;
  margin: 3rem 0px;

[Killed] StringLiteral
src/main/pages/HomePage.js:10:18
         fontSize: "75px",
         borderRadius: "7px",
         backgroundColor: "white",
-        opacity: ".9",
+        opacity: "",
         padding: "10px",
         textAlign: "center",
killedBy: HomePage tests expected CSS properties
statusReason: Error: expect(element).toHaveStyle()

- Expected

  background-color: white;
  border-radius: 7px;
  font-size: 75px;
  margin: 3rem 0px;

[Killed] StringLiteral
src/main/pages/HomePage.js:16:18
         margin: "3rem 0",
     },
     infoSection: {
-        padding: "20px",
+        padding: "",
         borderRadius: "7px",
         margin: "20px 0",
killedBy: HomePage tests expected CSS properties
statusReason: Error: expect(element).toHaveStyle()

- Expected

- borderRadius: 7px;
  margin: 20px 0px;
- padding: 20px;
