[Killed] BlockStatement
src/main/pages/HomePage.js:4:36
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import { useCurrentUser } from "main/utils/currentUser";
 
-export default function HomePage() {
-  // Stryker disable next-line all: it is acceptable to exclude useState calls from mutation testing
-  const { data: currentUser } = useCurrentUser();
-  const firstName = (currentUser?.root?.user?.givenName) || "";
-  // Stryker restore all
-
-  
-  // Stryker disable all : TODO: restructure this code to avoid the need for this disable
-  return (
-    <div data-testid={"HomePage-main-div"}>
-      <BasicLayout>
-        <h1 data-testid="homePage-title" style={{ fontSize: "75px", borderRadius: "7px", backgroundColor: "white", opacity: ".9" }} className="text-center border-0 my-3">Welcome {firstName}</h1>
-      </BasicLayout>
-    </div>
-  )
-  // Stryker restore all
-}
+export default function HomePage() {}
 
killedBy: HomePage tests expected CSS properties
statusReason: Error: HomePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] OptionalChaining
src/main/pages/HomePage.js:7:22
 export default function HomePage() {
   // Stryker disable next-line all: it is acceptable to exclude useState calls from mutation testing
   const { data: currentUser } = useCurrentUser();
-  const firstName = (currentUser?.root?.user?.givenName) || "";
+  const firstName = (currentUser?.root.user?.givenName) || "";
   // Stryker restore all
 
killedBy: HomePage tests expected CSS properties
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Survived] LogicalOperator
src/main/pages/HomePage.js:7:21
 export default function HomePage() {
   // Stryker disable next-line all: it is acceptable to exclude useState calls from mutation testing
   const { data: currentUser } = useCurrentUser();
-  const firstName = (currentUser?.root?.user?.givenName) || "";
+  const firstName = currentUser?.root?.user?.givenName && "";
   // Stryker restore all
 
